# Nominal or One Hot Encoding Technique
#### Nominal encoding is technique used to transform categorical variable that have no intrinsic ordering encoding is one-hot encoding, which creates a binary vector for each category in the variable.

In [2]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd

In [5]:
data = pd.DataFrame({
    'cities' : ["mumbai","delhi","haryana","mumbai","mumbai","delhi","delhi","haryana"]
})

In [6]:
data

    cities
0   mumbai
1    delhi
2  haryana
3   mumbai
4   mumbai
5    delhi
6    delhi
7  haryana

In [8]:
data_encoding = OneHotEncoder()

In [22]:
data_trf = data_encoding.fit_transform(data[['cities']])

In [23]:
final_encoding = pd.DataFrame(data_trf.toarray())

In [25]:
pd.concat([data,final_encoding],axis=1)

    cities    0    1    2
0   mumbai  0.0  0.0  1.0
1    delhi  1.0  0.0  0.0
2  haryana  0.0  1.0  0.0
3   mumbai  0.0  0.0  1.0
4   mumbai  0.0  0.0  1.0
5    delhi  1.0  0.0  0.0
6    delhi  1.0  0.0  0.0
7  haryana  0.0  1.0  0.0